Add human validation results
